W4D2/n99cats/app/controllers/cats_controller.rb

 def update
    @cat = Cat.find_by(id: params[:id])

    if @cat.update_attributes(cat_params)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "cats" SET "description" = $1, "color" = $2, "updated_at" = $3 WHERE "cats"."id" = $4  [["description", "          white cat\r\n        "], ["color", "red"], ["updated_at", "2017-06-21 00:30:22.258852"], ["id", 1]]

  def create
    @cat = Cat.new(cat_params)
    if @cat.save
---
INSERT INTO "cats" ("birth_date", "color", "name", "description", "gender", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"