w4d1/routes/app/controllers/artwork_shares_controller.rb

  def create
    @artwork_share = ArtworkShare.new(artwork_share_params)
    if @artwork_share.save
---
INSERT INTO "artwork_shares" ("artwork_id", "viewer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["artwork_id", 2], ["viewer_id", 9], ["created_at", "2017-06-20 00:05:52.917089"], ["updated_at", "2017-06-20 00:05:52.917089"]]

  def destroy
    @artwork_share = ArtworkShare.find(params[:id])
    if @artwork_share.destroy
---
SELECT  "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "artwork_shares" WHERE "artwork_shares"."id" = $1  [["id", 3]]