w4d1/routes/app/controllers/artworks_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
    def index
      @user = User.find(params[:artist_id])

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "artworks" SET "title" = $1, "updated_at" = $2 WHERE "artworks"."id" = $3  [["title", "Masterpiece"], ["updated_at", "2017-06-19 23:44:15.009801"], ["id", 1]]
---
  def update
    @artwork = Artwork.find(params[:id])
    @artwork.update_attributes(artwork_params)