w4d1/routes/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
  def artworks
    @user = User.find(params[:user_id])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["name", "joey"], ["updated_at", "2017-06-19 22:12:00.918842"], ["id", 3]]
---
  def edit
    @user = User.find(params[:id])
    if @user.update_attributes(user_params)